/* $ObjectName=MAFLogonManagerNG_iOS */
/* $Collection=frwk.tools.ios */
/* $Domain=BC */
/* $Developer=I043975 */
/* $Description=Mobile Application Framework - iOS Reusable Tool Components */

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidParameter" = "Érvénytelen paraméter";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationCode" = "Érvénytelen műveletkód";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCommunicationManagerError" = "Nem sikerült csatlakozni a szerverhez. Ellenőrizze a bejelentkezési adatokat.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorUserAlreadyLoggedIn" = "A felhasználó már be van jelentkezve";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationExecutionInProgress" = "A művelet végrehajtása már folyamatban van";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidOperationContext" = "Érvénytelen műveleti kontextus";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidCommunicatorId" = "Érvénytelen azonosító a kommunikációs protokollhoz";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidActionItemId" = "Érvénytelen művelettétel-azonosító";

/* XMSG: message */
"keyErrDescrMAFLogonErrorCouldNotDecideCommunicator" = "Nem sikerült meghatározni a kommunikációs protokollt";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidBackendPassword" = "Ellenőrizze jelszavát";

/* XMSG: message */
"keyErrDescrMAFLogonErrorDeviceAlreadyRegistered" = "Ez a készülék már regisztrálva van egy másik felhasználónál.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorPasswordsNotEqual" = "A megadott azonosítókódok nem egyeznek.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorOperationNotAllowed" = "A művelelet nincs megengedve ebben a státusban";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidServerHost" = "Elégtelen vagy érvénytelen bejelentkezési adatokat adott meg. Próbálja újra.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorResetErrorCheckNetwork" = "Nem sikerült visszaállítani az alkalmazást. Ellenőrizze, hogy csatlakozott-e a hálózathoz.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckLoginData" = "Nem sikerült csatlakozni a szerverhez. Ellenőrizze a bejelentkezési adatokat.";

/* XMSG */
"keyErrDescrMAFLogonErrorCheckUsernamePassword" = "Ellenőrizze a felhasználónevet és a jelszót.";

/* XMSG */
"keyErrDescrMAFLogonErrorConsultWithAdministrator" = "Nem sikerült kapcsolódni a szerverhez. Forduljon az adminisztrátorhoz.";

/* XMSG */
"keyErrDescrMAFLogonErrorInvalidLoginData" = "Elégtelen vagy érvénytelen bejelentkezési adatokat adott meg. Próbálja újra.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeCorrect" = "Adja meg a helyes azonosítókódot.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDigit" = "Olyan azonosítókódot adjon meg, amely legalább egy számot tartalmaz.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeDontMatch" = "A megadott azonosítókódok nem egyeznek.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeExpired" = "Az azonosítókód lejárt, ezért módosítania kell.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLength" = "Olyan azonosítókódot adjon meg, amely legalább {0} karaktert tartalmaz.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeLowercase" = "Olyan azonosítókódot adjon meg, amely legalább egy kisbetűs karaktert tartalmaz.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeSpecialCharacters" = "Olyan azonosítókódot adjon meg, amely legalább egy különleges karaktert tartalmaz.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUniqueCharacters" = "Olyan azonosítókódot adjon meg, amely legalább {0} egyedi karakterből áll.";

/* XMSG */
"keyErrDescrMAFLogonErrorPasscodeUppercase" = "Olyan azonosítókódot adjon meg, amely legalább egy nagybetűs karaktert tartalmaz.";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateKeyGeneration" = "Nem sikerült lehívni a kulcsot a tanúsítványhoz";

/* XMSG */
"keyErrDescrMAFLogonErrorCertificateGeneration" = "Nem sikerült lehívni a tanúsítványt";

/* XMSG */
"keyErrDescrMAFLogonErrorAppSettingsValidation" = "Application Setting property validation failed for key:";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorUnknown" = "Ismeretlen hiba";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorAlreadyExists" = "A biztonságos tároló már létezik";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDataTypeError" = "Adattípushiba";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorDoesNotExist" = "A biztonságos tároló nem létezik";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidArg" = "Érvénytelen argumentum";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorInvalidPassword" = "Adja meg a helyes azonosítókódot.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorLocked" = "A biztonságos tároló zárolva van";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorOutOfMemory" = "Elfogyott a biztonságos tároló memóriája";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordExpired" = "Az azonosítókód lejárt, ezért módosítania kell.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequired" = "Olyan azonosítókódot adjon meg, amely legalább {0} egyedi karakterből áll.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresDigit" = "Olyan azonosítókódot adjon meg, amely legalább egy számot tartalmaz.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresLower" = "Olyan azonosítókódot adjon meg, amely legalább egy kisbetűs karaktert tartalmaz.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresSpecial" = "Olyan azonosítókódot adjon meg, amely legalább egy különleges karaktert tartalmaz.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordRequiresUpper" = "Olyan azonosítókódot adjon meg, amely legalább egy nagybetűs karaktert tartalmaz.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinLength" = "Olyan azonosítókódot adjon meg, amely legalább {0} karaktert tartalmaz.";

/* XMSG: message */
"keyErrDescrMAFSecureStoreManagerErrorPasswordUnderMinUniqueChars" = "Olyan azonosítókódot adjon meg, amely legalább {0} egyedi karakterből áll.";

/* XMSG */
"keyErrDescrMAFSecureStoreManagerErrorDeleted" = "A biztonsági tároló törlődött";

/* XMSG */
"keyErrDescrMAFLogonErrorOperationNotSupported" = "A művelet nem támogatott.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidMCIMSSOPin" = "Érvénytelen SSO kód";

/* XMSG: message */
"keyErrDescrMAFLogonErrorAfariaInvalidCredentials" = "Érvénytelen Afaria bejelentkezési adatok";

/* XMSG: message */
"keyErrDescrMAFLogonErrorClientIdentityNotFound" = "Ügyfélidentitás nem található";

/* XMSG: message */
"keyErrDescrMAFLogonErrorURLValidationFailed" = "Hozzáférés megtagadva";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserInitializationError" = "Cannot instantiate the xml parser.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorXMLParserError" = "Error during xml parsing.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorSettingsDownloadFailed" = "Settings download failed.";

/* XMSG: message */
"keyErrDescrMAFLogonErrorHTTPDomainError" = "HTTP domain error with response status:";

/* XMSG: message */
"keyErrDescrMAFLogonErrorInvalidJSONData" = "JSON data is invalid";

/* XMSG: message */
"keyErrDescrMAFLogonErrorJSONParserError" = "Error during json parsing";

